IDEA StatiCa Open Model
Loading Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Loading identification
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.Loading
 IdeaRS.OpenModel.Result.ResultOfLoading
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class Loading
Public Class Loading
public ref class Loading
The Loading type exposes the following members.
Constructors
Name | Description
Loading()
 Constructor
Loading(LoadingType, Int32)
 Constructor
Top
Properties
Name | Description
Id
 Id of loading
LoadingType
 Type of loading
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace